In [4]:
import pandas as pd

csv = "./data/SP500_Earnings_Per_Share.csv"
dataframe = pd.read_csv(csv)

dataframe.head()

                 Date  Value
0   December 31, 2023  47.79
1  September 30, 2023  47.65
2       June 30, 2023  48.58
3      March 31, 2023  48.41
4   December 31, 2022  39.61

In [6]:
#select data using square brackets
dataframe['Date']

0      December 31, 2023
1     September 30, 2023
2          June 30, 2023
3         March 31, 2023
4      December 31, 2022
5     September 30, 2022
6          June 30, 2022
7         March 31, 2022
8      December 31, 2021
9     September 30, 2021
10         June 30, 2021
11        March 31, 2021
12     December 31, 2020
13    September 30, 2020
14         June 30, 2020
15        March 31, 2020
16     December 31, 2019
17    September 30, 2019
18         June 30, 2019
19        March 31, 2019
20     December 31, 2018
21    September 30, 2018
22         June 30, 2018
23        March 31, 2018
24     December 31, 2017
25    September 30, 2017
26         June 30, 2017
27        March 31, 2017
28     December 31, 2016
29    September 30, 2016
30         June 30, 2016
31        March 31, 2016
32     December 31, 2015
33    September 30, 2015
34         June 30, 2015
35        March 31, 2015
36     December 31, 2014
37    September 30, 2014
38         June 30, 2014
39        March 31, 2014
40     December 31, 2013
41    September 30, 2013
42         June 30, 2013
43        March 31, 2013
44     December 31, 2012
45    September 30, 2012
46         June 30, 2012
47        March 31, 2012
48     December 31, 2011
49    September 30, 2011
Name: Date, dtype: object

In [16]:
#select data using loc
dataframe.loc[[0]]

                Date  Value
0  December 31, 2023  47.79

In [18]:
#select data using loc
dataframe.iloc[[0]]

                Date  Value
0  December 31, 2023  47.79

In [50]:
data = (
    {'X1':[0,1,2],
     'Y1':['a','b','c'],
     'Y' :[0.1,0.2,0.3]
    }
)

dataframe2 = pd.DataFrame(data)
dataframe2

   X1 Y1    Y
0   0  a  0.1
1   1  b  0.2
2   2  c  0.3

In [42]:
#select column X1 and Y1 into a new dataframe
dataframe2[['X1','Y1']]

   X1 Y1
0   0  a
1   1  b
2   2  c

In [40]:
#select the first two rows using slice indexing
dataframe2[:2]

   X1 Y1    Y
0   0  a  0.1
1   1  b  0.2

In [44]:
dataframe2[dataframe2['X1']>1]

   X1 Y1    Y
2   2  c  0.3